Tekla Open API Reference for Tekla Structures 2025
ModelInfo Properties
The ModelInfo type exposes the following members.
Properties
Name | Description
CurrentPhase
 The number of the Tekla Structures model's current phase.
ModelName
 The name of the Tekla Structures model.
ModelPath
 The path to the Tekla Structures model.
NorthDirection
 The north direction of the current Tekla Structures model.
SharedModel
 The read-only property of the Tekla Structures model's sharing status.
SingleUserModel
 The read-only property if the Tekla Structures model is a single user model.
Top
See Also
Reference
ModelInfo Class
Tekla.Structures.Model Namespace